init.org
# -*- mode: org; coding: utf-8; -*-
:PROPERTIES: header-args:emacs-lisp :tangle
:ID:       20BF3D68-6887-4D5C-878D-17C2AD5F97B8
:END:
#+title: init.el config
#+auto_tangle: t

sibling file: [[file:early-init.org][early-init.el config]]

https://www.bing.com

* init


#+begin_src emacs-lisp :tangle no
;; test
;; {{{
(show-paren-mode)
(setq show-paren-style 'parenthesis
      show-paren-context-when-offscreen 'overlay)
;;
(add-to-list 'load-path
             (expand-file-name
              "bisec"
              (concat user-emacs-directory)
              )
             )
;; }}}
#+end_src

** tips

#+begin_src emacs-lisp :tangle no
(add-to-list 'load-path (expand-file-name
                         "init.org"
                         (concat user-emacs-directory)
                         )
             )
#+end_src

** File Header

#+begin_src emacs-lisp :tangle yes
;; -*- coding: utf-8; lexical-binding: t; -*-
;; -*- origami-fold-style: triple-braces -*-
;;; init.el

;; Date: 2023-01-06T12:52:58+0800
#+end_src

** garbage collection & file-name-handler

#+begin_src emacs-lisp :tangle yes
(let (
      (gc-cons-threshold most-positive-fixnum)
      (file-name-handler-alist nil)
      )
  )
#+end_src

** Emacs Lisp

#+begin_src emacs-lisp :tangle yes
(add-hook 'emacs-lisp-mode-hook 'turn-off-auto-fill)
#+end_src

** use-package

#+begin_src emacs-lisp :tangle yes
;; use-package
;; {{{
(require 'use-package-ensure)
(setq use-package-always-ensure t)
(setq use-package-verbose t)
;; }}}
#+end_src

** 时间 date & time

2023-01-08T21:00:08+0800

#+begin_src emacs-lisp :tangle yes
;; time
;; {{{
(defun my/date-and-time-iso8601 ()
  (interactive)
  (insert (format-time-string "%FT%T%z"))
  )

(keymap-global-set "C-c D" #'my/date-and-time-iso8601)
;; }}}
#+end_src

** 图表与 PDF

#+begin_src emacs-lisp :tangle yes
(defun my/webkit-open-local-file (fpath)
  (interactive "fEnter file path: ")
  (when (member (substring fpath -4 nil) '("html" ".pdf" ".mp4"))
    (xwidget-webkit-browse-url
     (concat "file://" (expand-file-name fpath)))
    )
  )
#+end_src

** 网络搜索
#+begin_src emacs-lisp :tangle yes
(defun my/open-microsoft-bing ()
  (interactive)
  (xwidget-webkit-browse-url "https://www.bing.com" t)
  )
#+end_src

#+RESULTS:
: my/open-microsoft-bing

** 字体和语法高亮 font & syntax

#+begin_src emacs-lisp :tangle yes
;; font and syntax
;; {{{
(set-face-attribute 'default nil
                    :family "Sarasa Mono SC Nerd"
                    :height 140 ;; 更改显示字体大小
                    )
(global-font-lock-mode t) ;; turn on syntax highlighting for all buffers
;; }}}
#+end_src

** pretty-symbols

#+begin_src emacs-lisp :tangle yes
;; pretty-symbols
;; {{{
(add-hook 'prog-mode-hook 'prettify-symbols-mode)
(setq-default prettify-symbols-alist
              '(("lambda" . ?λ)
                ("function" . ?𝑓)))
;; }}}
#+end_src

** tree-sitter

#+begin_src emacs-lisp :tangle yes
;; tree-sitter
;; {{{
(require 'treesit)
;; (tree-sitter-load 'elisp "elisp")
;; (add-to-list 'tree-sitter-major-mode-language-alist '(emacs-lisp-mode . elisp))
(when (treesit-available-p)
  (setq major-mode-remap-alist
        '((c-mode          . c-ts-mode)
          (cmake-mode      . cmake-ts-mode)
          ;; (c++-mode        . c++-ts-mode)
          (conf-toml-mode  . toml-ts-mode)
          (csharp-mode     . csharp-ts-mode)
          (css-mode        . css-ts-mode)
          (java-mode       . java-ts-mode)
          (js-mode         . js-ts-mode)
          (javascript-mode . js-ts-mode)
          (js-json-mode    . json-ts-mode)
          (python-mode     . python-ts-mode)
          (ruby-mode       . ruby-ts-mode)
          (sh-mode         . bash-ts-mode))))
;; }}}
#+end_src

** chunk

#+begin_src emacs-lisp :tangle yes
;; chunk
;; {{{
;; Increase how much is read from processes in a single chunk (default is 4kb)
(setq read-process-output-max #x10000) ;; 64kb
;; }}}
#+end_src

** 书签 Bookmark

#+begin_src emacs-lisp :tangle no
;; bookmark
;; {{{
;; https://www.youtube.com/watch?v=ajiEBK2swKo

;; }}}
#+end_src

** 剪贴板 clipboard

#+begin_src emacs-lisp :tangle yes
;; zap-up-to-char
(keymap-global-set "M-z" #'zap-up-to-char)
#+end_src

** 注释 comment

#+begin_src emacs-lisp :tangle yes
;; comment
;; {{{
(defun comment-current-line-dwim ()
  "Comment or uncomment the current line/region."
  (interactive)
  (save-excursion
    (if (use-region-p)
        (comment-or-uncomment-region (region-beginning) (region-end))
      (push-mark (beginning-of-line) t t)
      (end-of-line)
      (comment-dwim nil)
      )
    )
  )
(keymap-global-set "H-/" #'comment-current-line-dwim)
;; }}}
#+end_src


** 文件和缓冲区 file/buffer

#+begin_src emacs-lisp :tangle yes
;; warn when opening files bigger than 100 MB
(setq large-file-warning-threshold (* 100 1000 1000))

;; 使 Emacs 自动加载外部修改过的文件
(global-auto-revert-mode 1)

;; Open file system read-only files as read-only in Emacs as well.
(setq view-read-only t)
#+end_src

*** ibuffer

#+begin_src emacs-lisp :tangle yes
;; ibuffer
;; {{{
(use-package ibuffer
  :bind ("C-x C-b" . ibuffer)
  ;; :custom
  ;; (ibuffer-formats
  ;;  '((mark modified read-only locked " "
  ;;          (name 35 35 :left :elide)
  ;;          " "
  ;;          (size 9 -1 :right)
  ;;          " "
  ;;          (mode 16 16 :left :elide)
  ;;          " " filename-and-process)
  ;;    (mark " "
  ;;          (name 16 -1)
  ;;          " " filename)))
  :config
  (setq ibuffer-saved-filter-groups
        (quote (("default"
                 ("dired" (mode . dired-mode))
                 ("emacs" (or
                           (mode . emacs-lisp-mode)
                           (name . "^\\*scratch\\*$")
                           (name . "^\\*Messages\\*$")
                           ))
                 ("org" (or (mode . org-mode)
                            (mode . org-agenda-mode)
                            (mode . org-src-mode)
                            ))
                 ;;               ("erc" (mode . erc-mode))

                 ("planner" (or
                             (name . "^\\*Calendar\\*$")
                             (name . "^diary$")
                             (mode . muse-mode)))
                 ("PDF"    (mode . pdf-view-mode))
                 ("python" (mode . python-mode))
                 ;; ("gnus" (or
                 ;;          (mode . message-mode)
                 ;;          (mode . bbdb-mode)
                 ;;          (mode . mail-mode)
                 ;;          (mode . gnus-group-mode)
                 ;;          (mode . gnus-summary-mode)
                 ;;          (mode . gnus-article-mode)
                 ;;          (name . "^\\.bbdb$")
                 ;;          (name . "^\\.newsrc-dribble")))
                 ))))

  (add-hook 'ibuffer-mode-hook
            (lambda ()
              (ibuffer-switch-to-saved-filter-groups "default")))
  )

;; }}}
#+end_src

*** recentf

#+begin_src emacs-lisp :tangle yes
(recentf-mode 1)
(setq recentf-max-menu-items 50)
(setq recentf-max-saved-items 50)
#+end_src

*** auto-save

#+begin_src emacs-lisp :tangle yes
;; auto-save: 定期预存，防止停电、系统崩溃等原因造成的数据损失
;; {{{
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

(add-hook 'after-init-hook 'auto-save-visited-mode) ;; save file when buffer/focus change 自动保存
(setq
 auto-save-default t ; auto-save every buffer that visits a file
 auto-save-timeout 20 ; number of seconds idle time before auto-save (default: 30)
 auto-save-interval 200 ; number of keystrokes between auto-saves (default: 300)
 )
;; }}}
#+end_src


*** backup

#+begin_src emacs-lisp :tangle yes
;; backup file: 备份
;; {{{
;; https://stackoverflow.com/questions/151945/how-do-i-control-how-emacs-makes-backup-files
;;
;; (defvar --backup-directory (concat user-emacs-directory "backups"))
;; (if (not (file-exists-p --backup-directory))
;;         (make-directory --backup-directory t))
;; (setq backup-directory-alist `(("." . ,--backup-directory)))
;; (setq backup-directory-alist `((".*" . ,(expand-file-name "backup" user-emacs-directory))))
(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq make-backup-files t         ; backup of a file the first time it is saved.
      backup-by-copying t         ; don't clobber symlinks
      version-control t           ; version numbers for backup files
      delete-old-versions t       ; delete excess backup files silently
      delete-by-moving-to-trash t
      dired-kept-versions 2
      kept-old-versions 6 ; oldest versions to keep when a new numbered backup is made (default: 2)
      kept-new-versions 9 ; newest versions to keep when a new numbered backup is made (default: 2)
      )
;; }}}
#+end_src

*** lockfile

#+begin_src emacs-lisp :tangle yes
;; lockfile: 不同进程修改同一文件
;; {{{
(setq create-lockfiles t)
(setq lock-file-name-transforms
      '(("\\`/.*/\\([^/]+\\)\\'" "/var/tmp/\\1" t)))
;; }}}
#+end_src

