init.org
*** org modules

#+begin_src emacs-lisp :tangle no
(setq org-modules (quote
                   (org-crypt
                    org-id
                    org-info
                    org-habit
                    org-inlinetask
                    org-protocol
                    )
                   )
      )
#+end_src

*** keymap

#+begin_src emacs-lisp :tangle yes
;; org-mode: keymap
;; {{{
;; (setq org-startup-indented t)
;; (keymap-global-set "C-c l"   #'org-store-link) ; C-c C-l org-insert-link
(keymap-global-set "C-c n o" #'org-id-get-create)
(keymap-global-set "C-c H-i" #'org-insert-structure-template)
;; }}}
#+end_src

*** narrow


光标位置：在代码块内 (org-in-src-block-p)，在代码块外
当前状态：org-mode, org-src-mode (org-src-mode)


| 光标位置 | mode         | 切换                |
| 代码块内 | org-src-mode | org-edit-src-exit   |
| 代码块外 |              | show-heading-tidily |
| 代码块内 |              | org-edit-special    |


#+begin_src emacs-lisp :tangle yes
;; org-mode: head/title
;; (org-in-src-block-p)
;; {{{
;; 显示当前 heading 内容并折叠其他
;; https://emacstil.com/til/2021/09/09/fold-heading/
(defun my/org-show-current-heading-tidily ()
  (interactive)
  "Show next entry, keeping other entries closed."
  (if (save-excursion (end-of-line) (outline-invisible-p))
      (progn (org-show-entry) (show-children))
    (save-excursion
      (outline-back-to-heading)
      (unless (and (bolp) (org-on-heading-p))
        (org-up-heading-safe)
        (hide-subtree)
        (error "Boundary reached"))
      (org-overview)
      (org-reveal t)
      (org-show-entry)
      (show-children))
    )
  )

(keymap-global-set "C-c H-n" #'my/org-show-current-heading-tidily)

;; (defun my/org-narrow-heading-or-code-block ()
;;   (interactive)
;;   (cond ((org-in-src-block-p)
;;               (org-src-mode)
;;                t)
;;         (org-edit-src-exit)
;;         (org-show-current-heading-tidily)
;;         )
;;   (cond (eq (progn (eq (org-in-src-block-p) t)
;;                    (eq (org-src-mode) nil)) t)
;;         (org-edit-special)
;;         (delete-other-windows)
;;         )

;;   (cond (eq (progn  (eq (org-in-src-block-p) nil)
;;                     (eq (org-src-mode) nil)) t)
;;         (org-show-current-heading-tidily)
;;         )
;;   nil
;;   )
;; (keymap-global-set "C-c H-n" #'my/org-narrow-heading-or-code-block)
;; }}}
#+end_src

*** head/title

*** code block

#+begin_src emacs-lisp :tangle yes
(setq org-src-lang-modes
      '(
        ("C" . c)
        ("C++" . c++)
        ("asymptote" . asy)
        ("bash" . sh)
        ("beamer" . latex)
        ("calc" . fundamental)
        ("cpp" . c++)
        ("desktop" . conf-desktop)
        ("ditaa" . artist)
        ("dot"  . graphviz-dot)
        ("elisp" . emacs-lisp)
        ("json"  . json-ts)
        ("ocaml" . tuareg)
        ("screen" . shell-script)
        ("shell" . sh)
        ("sqlite" . sql)
        ("toml" . conf-toml)
        ))
(setq org-babel-python-command "python3")
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (awk         .       t)
   ;; (c           .       t) ; FIXME
   (calc        .       t)
   (comint      .       t)
   (css         .       t)
   (dot         .       t) ; Graphviz
   (emacs-lisp  .       t)
   (eshell      .       t)
   (gnuplot     .       t)
   (haskell     .       t)
   (js          .       t)
   (latex       .       t)
   (lua         .       t)
   (org         .       t) ; 跨文件调用 src block
   (perl        .       t)
   (plantuml    .       t)
   (python      .       t)
   (ruby        .       t)
   (sed         .       t)
   (shell       .       t)
   (sql         .       t)
   (sqlite      .       t)
   ))
(setq org-src-fontify-natively 1)         ;代码块语法高亮
(setq org-src-tab-acts-natively 1)        ;开启代码块语法缩进/格式化
(setq org-edit-src-content-indentation 0) ;代码块初始缩进范围
#+end_src

#+begin_src emacs-lisp :tangle yes
(setq org-fontify-todo-headline nil)
(setq org-fontify-done-headline nil)

;; org-mode Face for org-id links.                                      ; FIXME
;; (defface my-org-id-link
;;   '((t
;;      :inherit org-link
;;      :underline nil
;;      ;; :foreground "#009600"
;;      :group 'org-faces
;;      ))
;;   :group 'org-faces)
;; (with-eval-after-load 'ol
;;   (org-link-set-parameters "id" :face 'my-org-id-link))
;; }}}
#+end_src

