init.org
*** Link

#+begin_src emacs-lisp :tangle yes
(setq my-linkcolor-org "wheat3")
(setq my-linkcolor-file "MediumSeaGreen")
(setq my-linkcolor-web "DeepSkyBlue")

(defun my-set-linkcolors ()
  "Defines the colors of various link colors"
  (interactive)

  ;; Org links --------------------------------------------------------------------------

  (org-link-set-parameters "id" :face `(:foreground ,my-linkcolor-org :underline t))
  (org-link-set-parameters "contact" :face `(:foreground ,my-linkcolor-org :underline t))

  ;; File links --------------------------------------------------------------------------

  (org-link-set-parameters "file" :face `(:foreground ,my-linkcolor-file :underline t))
  ;; defined elsewhere;; (org-link-set-parameters "tsfile" :face '`(:foreground "DarkSeaGreen" :underline t))
  (org-link-set-parameters "pdf" :face `(:foreground ,my-linkcolor-file :underline t))

  (org-link-set-parameters "EPA" :face `(:foreground ,my-linkcolor-file :underline t))
  (org-link-set-parameters "EPAAFO" :face `(:foreground ,my-linkcolor-file :underline t))
  (org-link-set-parameters "JAFO" :face `(:foreground ,my-linkcolor-file :underline t))
  (org-link-set-parameters "DAKEPA" :face `(:foreground ,my-linkcolor-file :underline t))
  (org-link-set-parameters "BMTSK" :face `(:foreground ,my-linkcolor-file :underline t))
  (org-link-set-parameters "ISO" :face `(:foreground ,my-linkcolor-file :underline t))

  (org-link-set-parameters "gemSpec_DS_Anbieter"
                           :face `(:foreground ,my-linkcolor-file :underline t))
  (org-link-set-parameters "gemSpec_Net"
                           :face `(:foreground ,my-linkcolor-file :underline t))
  (org-link-set-parameters "gemSpec_PKI"
                           :face `(:foreground ,my-linkcolor-file :underline t))
  (org-link-set-parameters "gemSpec_IDP_Dienst"
                           :face `(:foreground ,my-linkcolor-file :underline t))

  (org-link-set-parameters "messageid"
                           :face `(:foreground ,my-linkcolor-file :underline t))

  ;; Web links --------------------------------------------------------------------------

  (org-link-set-parameters "http" :face `(:foreground ,my-linkcolor-web :underline t))
  (org-link-set-parameters "https" :face `(:foreground ,my-linkcolor-web :underline t))

  )

(defun my-set-linkcolors ()
  "Defines the colors of various link colors"
  (interactive)

  ;; Org links --------------------------------------------------------------------------

  (org-link-set-parameters "id" :face '(:foreground "wheat3" :underline t))
  (org-link-set-parameters "contact" :face '(:foreground "wheat3" :underline t))

  ;; File links --------------------------------------------------------------------------

  (org-link-set-parameters "file" :face '(:foreground "MediumSeaGreen" :underline t))
  ;; defined elsewhere;; (org-link-set-parameters "tsfile" :face ''(:foreground "DarkSeaGreen" :underline t))
  (org-link-set-parameters "pdf" :face '(:foreground "MediumSeaGreen" :underline t))

  (org-link-set-parameters "EPA" :face '(:foreground "MediumSeaGreen" :underline t))
  (org-link-set-parameters "EPAAFO" :face '(:foreground "MediumSeaGreen" :underline t))
  (org-link-set-parameters "JAFO" :face '(:foreground "MediumSeaGreen" :underline t))
  (org-link-set-parameters "DAKEPA" :face '(:foreground "MediumSeaGreen" :underline t))
  (org-link-set-parameters "BMTSK" :face '(:foreground "MediumSeaGreen" :underline t))

  (org-link-set-parameters "gemSpec_DS_Anbieter"
                           :face '(:foreground "MediumSeaGreen" :underline t))
  (org-link-set-parameters "gemSpec_Net"
                           :face '(:foreground "MediumSeaGreen" :underline t))
  (org-link-set-parameters "gemSpec_PKI"
                           :face '(:foreground "MediumSeaGreen" :underline t))
  (org-link-set-parameters "gemSpec_IDP_Dienst"
                           :face '(:foreground "MediumSeaGreen" :underline t))

  (org-link-set-parameters "messageid"
                           :face '(:foreground "MediumSeaGreen" :underline t))

  ;; Web links --------------------------------------------------------------------------

  (org-link-set-parameters "http" :face '(:foreground "DeepSkyBlue" :underline t))
  (org-link-set-parameters "https" :face '(:foreground "DeepSkyBlue" :underline t))

  )

(my-set-linkcolors) ;; set colors when loading
#+end_src

*** URL

**** URL Title                                                        :FIXME:

#+begin_src emacs-lisp :tangle no
(defun my/org-get-url-page-title (url)
  "retrieve title of web page.
from: http://www.opensubscriber.com/message/help-gnu-emacs@gnu.org/14332449.html"
  (interactive)
  (let ((title))
    (with-current-buffer (url-retrieve-synchronously url)
      (goto-char (point-min))
      (re-search-forward "<title>\\([^<]*\\)</title>" nil t 1)
      (setq title (match-string 1))
      (goto-char (point-min))
      (re-search-forward "charset=\\([-0-9a-zA-Z]*\\)" nil t 1)
      (string-replace "&nbsp;" " "
                      ;;(decode-coding-string title (intern (match-string 1)))
                      ;; following line fixes charset issues from
                      ;; previous line:
                      (decode-coding-string title 'utf-8)
                      ))
    )
  )
#+end_src

**** Linkify                                                          :FIXME:

#+begin_src emacs-lisp :tangle no
(defun my/org-url-linkify ()
  "Make URL at cursor point into an Org-mode link.
If there's a text selection, use the text selection as input.

Example: http://example.com/xyz.htm
becomes
\[\[http://example.com/xyz.htm\]\[Source example.com\]\]

Adapted code from: http://ergoemacs.org/emacs/elisp_html-linkify.html"
  (interactive)
  (let (resultLinkStr bds p1 p2 domainName)
    ;; get the boundary of URL or text selection
    (if (region-active-p)
        (setq bds (cons (region-beginning) (region-end)) )
      (setq bds (bounds-of-thing-at-point 'url))
      )
    ;; set URL
    (setq p1 (car bds))
    (setq p2 (cdr bds))
    (let (
          (url (buffer-substring-no-properties p1 p2))
          )
      ;; retrieve title
      (let ((title (my-cliplink-format-and-trim-title (replace-regexp-in-string "\n" " • " (my-www-get-page-title url)))))
        ;;(message (concat "title is: " title))
        ;;(setq url (replace-regexp-in-string "&" "&amp;" url))
        (let ((resultLinkStr (concat "[[" url "][" title "]]")))
          ;; delete url and insert the link
          (delete-region p1 p2)
          (insert resultLinkStr)
          )
        )
      )
    )
  )

#+end_src

*** 图像

#+begin_src emacs-lisp :tangle no
;; https://stackoverflow.com/a/73426792
(defun org-image-resize (frame)
  (when (derived-mode-p 'org-mode)
      (if (< (window-total-width) 80)
      (setq org-image-actual-width (window-pixel-width))
    (setq org-image-actual-width (* 80 (window-font-width))))
      (org-redisplay-inline-images)))

(add-hook 'window-size-change-functions 'org-image-resize)
#+end_src

#+begin_src emacs-lisp :tangle no
;; https://stackoverflow.com/a/73426792
(defun org-image-resize (frame)
  (when (derived-mode-p 'org-mode)
      (setq org-image-actual-width
	    (window-pixel-width)
	    ;; (- (window-pixel-width) 20)
	    )
      (org-redisplay-inline-images)))

(add-hook 'window-size-change-functions 'org-image-resize)
#+end_src

#+begin_src emacs-lisp :tangle no
(if (not (eq window-system 'x))
    (add-hook 'org-mode-hook
              '(lambda ()
                 (setq org-file-apps
                       (append '(
                                 ("\\.png\\'" . default)
                                 ("\\.jpg\\'" . default)
                                 ("\\.jpeg\\'" . default)
                                 ("\\.tiff\\'" . default)
                                 ("\\.doc\\'" . default)
                                 ("\\.docx\\'" . default)
                                 ("\\.xlsx\\'" . default)
                                 ("\\.pptx\\'" . default)
                                 ) org-file-apps )))))
#+end_src

*** todo

#+begin_src emacs-lisp :tangle no
(setq org-use-fast-todo-selection t)
#+end_src

#+begin_src emacs-lisp :tangle no
(add-hook 'org-mode-hook
          (lambda ()
            (push '("TODO"  . ?█) prettify-symbols-alist)
            (push '("DONE"  . ?✓) prettify-symbols-alist)
            (push '("WAITING"  . ?…) prettify-symbols-alist)
            (push '("CANCELLED"  . ?×) prettify-symbols-alist)
            (push '("SOMEDAY"  . ??) prettify-symbols-alist)))
#+end_src

#+begin_src emacs-lisp :tangle no
(setq org-todo-keywords (quote
                         (
                          (sequence "TODO(t)" "NEXT(n)" "STARTED(s)" "WAITING(w@/!)" "SOMEDAY(S!)" "|" "DONE(d!/!)" "CANCELLED(c@/!)")
                          )
                         )
      )
#+end_src

#+begin_src emacs-lisp :tangle no
(setq org-todo-keyword-faces
      (quote (("TODO"      :foreground "lightblue"    :weight bold)
              ("NEXT"      :foreground "red"          :weight bold)
              ("STARTED"   :foreground "red"          :weight bold)
              ("DONE"      :foreground "forest green" :weight bold)
              ("WAITING"   :foreground "orange"       :weight bold)
              ("TEAM"      :foreground "orange"       :weight bold)
              ("SOMEDAY"   :foreground "magenta"      :weight bold)
              ("CANCELLED" :foreground "forest green" :weight bold)
              ("QUOTE"     :foreground "red"          :weight bold)
              ("QUOTED"    :foreground "magenta"      :weight bold)
              ("APPROVED"  :foreground "forest green" :weight bold)
              ("EXPIRED"   :foreground "forest green" :weight bold)
              ("REJECTED"  :foreground "forest green" :weight bold)
              ("OPEN"      :foreground "blue"         :weight bold)
              ("CLOSED"    :foreground "forest green" :weight bold)
              ("PHONE"     :foreground "forest green" :weight bold))))
#+end_src

** mode-line

#+begin_src emacs-lisp :tangle yes
;; mode-line
;; {{{
(display-battery-mode t)    ;; display battery status
(setq column-number-mode t) ;; 在 mode line 数字形式显示光标所在列
;; }}}
#+end_src

