init.org
** 环境变量

#+begin_src emacs-lisp :tangle yes
;; exec-path-from-shell
;; {{{
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
(when (daemonp)
  (exec-path-from-shell-initialize))
;; }}}
#+end_src

** 快捷键

*** which-key + posframe

#+begin_src emacs-lisp :tangle yes
(use-package which-key
  :defer 1
  :config
  (which-key-mode)
  (setq which-key-idle-secondary-delay 0.5)
  (which-key-posframe-mode)
  )
#+end_src

*** free-keys

#+begin_src emacs-lisp :tangle yes
;; free-keys
;; {{{
(require 'free-keys)
(setq free-keys-modifiers '(
                            ""
                            ;; "A"
                            "C"
                            "H"
                            "M"
                            "S"
                            "s"
                            ;; "A-C"
                            ;; "A-H"
                            ;; "A-M"
                            ;; "A-S"
                            ;; "A-s"
                            "C-c H"
                            "C-H"
                            "C-M"
                            ;; "C-S"
                            "C-s"
                            ;; "M-S"
                            ;; "M-s"
                            "s-H"
                            ;; "S-s"
                            ;; "C-M-S"
                            ;; "C-M-s"
                            "C-c"
                            "C-x" ))
;; }}}
#+end_src

** Macro & 多光标

*** multiple-cursors

#+begin_src emacs-lisp :tangle yes
;; multiple-cursors
;; {{{
;; multiple-cursors-mode-enabled-hook
;; multiple-cursors-mode-disabled-hook
(use-package multiple-cursors
  :bind (
         ("H-c H-a" . mc/edit-beginnings-of-lines)
         ("H-c H-e" . mc/edit-ends-of-lines)
         ("H-c H-l" . mc/edit-lines)
         ("H-c H-n" . mc/mark-next-like-this)
         ("H-c H-p" . mc/mark-previous-like-this)
         ("H-c H-h" . mc/mark-all-like-this)
         ("H-c H-r" . set-rectangular-region-anchor)
         )
  )

(add-hook 'activate-mark-hook '(lambda ()
                                 (local-set-key
                                  (kbd "C-@")
                                  'set-rectangular-region-anchor)
                                 ))
(add-hook 'deactivate-mark-hook '(lambda ()
                                   (local-unset-key
                                    (kbd "C-@"))
                                   ))
;; }}}
#+end_src

*** macrostep

https://github.com/joddie/macrostep

*** markmacro

** 光标跳转

#+begin_src emacs-lisp :tangle yes
;; avy
;; {{{
;; https://karthinks.com/software/avy-can-do-anything
(keymap-global-set "C-;"     #'avy-goto-char)
(keymap-global-set "C-'"     #'avy-goto-char-2)
(keymap-global-set "M-g f"   #'avy-goto-line)
(keymap-global-set "M-g w"   #'avy-goto-word-1)
(keymap-global-set "M-g e"   #'avy-goto-word-0)
(keymap-global-set "C-c C-j" #'avy-resume)
;; }}}
#+end_src

** 字符/字符串

*** 括号

[[https://github.com/AmaiKinono/puni][AmaiKinono/puni]]: Structured editing (soft deletion, expression navigating & manipulating) that supports many major modes out 

*** 近义词/反义词

[[https://github.com/dp12/parrot][dp12/parrot: A package to rotate text and party with parrots at the same time]]

#+begin_src emacs-lisp :tangle yes
(use-package parrot
  :defer 2
  :bind (
         ("H-w r" . parrot-rotate-prev-word-at-point)
         ("H-w t" . parrot-rotate-next-word-at-point)
	 ("H-k H-k" . parrot-rotate-next-word-at-point)
	 ("H-k H-j" . parrot-rotate-prev-word-at-point)
         )
  :config
  (parrot-mode)
  (parrot-set-parrot-type 'emacs)
  (setq parrot-rotate-dict
        '(
	  ;; personal setting
	  (:rot ("¥" "$" "￥"))
	  (:rot ("nil" "t"))
	  (:rot ("setq" "defvar"))
	  ;;
          (:rot ("alpha" "beta") :caps t :lower nil)
          ;; => rotations are "Alpha" "Beta"

          (:rot ("snek" "snake" "stawp"))
          ;; => rotations are "snek" "snake" "stawp"

          (:rot ("yes" "no") :caps t :upcase t)
          ;; => rotations are "yes" "no", "Yes" "No", "YES" "NO"

          (:rot ("&" "|"))
          ;; => rotations are "&" "|"

          ;; default dictionary starts here ('v')
          (:rot ("begin" "end") :caps t :upcase t)
          (:rot ("enable" "disable") :caps t :upcase t)
          (:rot ("enter" "exit") :caps t :upcase t)
          (:rot ("forward" "backward") :caps t :upcase t)
          (:rot ("front" "rear" "back") :caps t :upcase t)
          (:rot ("get" "set") :caps t :upcase t)
          (:rot ("high" "low") :caps t :upcase t)
          (:rot ("in" "out") :caps t :upcase t)
          (:rot ("left" "right") :caps t :upcase t)
          (:rot ("min" "max") :caps t :upcase t)
          (:rot ("on" "off") :caps t :upcase t)
          (:rot ("prev" "next"))
          (:rot ("start" "stop") :caps t :upcase t)
          (:rot ("true" "false") :caps t :upcase t)
          (:rot ("&&" "||"))
          (:rot ("==" "!="))
          (:rot ("." "->"))
          (:rot ("if" "cond" "else" "elif"))
          (:rot ("ifdef" "ifndef"))
          (:rot ("int8_t" "int16_t" "int32_t" "int64_t"))
          (:rot ("uint8_t" "uint16_t" "uint32_t" "uint64_t"))
          (:rot ("0" "1" "2" "3" "4" "5" "6" "7" "8" "9"))
          (:rot ("1st" "2nd" "3rd" "4th" "5th" "6th" "7th" "8th" "9th" "10th"))
          )
        )
  )
#+end_src

*** 大小写

** 正则表达式

*** pcre2el

[[https://github.com/joddie/pcre2el][joddie/pcre2el: convert between PCRE, Emacs and rx regexp syntax]]

| Convert from | convert to |
|--------------+------------|
| ELISP        | RX         |
| ELISP        | SRE        |
| ELISP        | string     |
| PCRE         | ELISP      |
| PCRE         | RX         |
| PCRE         | SRE        |
| PCRE         | string     |
| RX           | ELISP      |
| RX           | PCRE       |
| RX           | SRE        |

test

#+begin_src python
re="(([\u2e80-\u9fff]+)([\n\r]{1,2})?([\s\t])?(([\u2e80-\u9fff]+)|(\w)+)([\s\t])?)"
#+end_src

#+begin_src emacs-lisp
(submatch
 (submatch
  (+ (any (48 . 117)))
  )
 (\?
  (submatch (** 1 2 (any 10 13)))
  )
 (\?
  (submatch (any 9 10 12 13 32))
  )
 (submatch (or
	    (submatch
	     (+ (any (48 . 117))))
	    (+
	     (submatch (any 95 alnum))
	     )
	    )
	   )
 (\?
  (submatch (any 9 10 12 13 32))
  )
 )
#+end_src

*** xr

** Emacs Lisp

*** 代码分析

elisp-depmap

*** 辅助编辑

#+begin_src emacs-lisp :tangle no
(use-package lisp
  :hook
  (after-save . check-parens))

(use-package elisp-mode
  :bind
  (:map emacs-lisp-mode-map
        ("C-c C-d C-d" . describe-function)
        ("C-c C-d d" . describe-function)
        ("C-c C-k" . eval-buffer)))

(use-package highlight-defined
  :ensure t
  :custom
  (highlight-defined-face-use-itself t)
  :hook
  (help-mode . highlight-defined-mode)
  (emacs-lisp-mode . highlight-defined-mode))

(use-package highlight-quoted
  :ensure t
  :hook
  (emacs-lisp-mode . highlight-quoted-mode))

(use-package highlight-sexp
  :quelpa
  (highlight-sexp :repo "daimrod/highlight-sexp" :fetcher github :version original)
  :hook
  (clojure-mode . highlight-sexp-mode)
  (emacs-lisp-mode . highlight-sexp-mode)
  (lisp-mode . highlight-sexp-mode))

(use-package eros
  :ensure t
  :hook
  (emacs-lisp-mode . eros-mode))

(use-package suggest
  :ensure t
  :defer t)

(use-package ipretty
  :defer t
  :ensure t
  :config
  (ipretty-mode 1))

(use-package nameless
  :ensure t
  :hook
  (emacs-lisp-mode .  nameless-mode)
  :custom
  (nameless-global-aliases '())
  (nameless-private-prefix t))


(use-package erefactor
  :ensure t
  :defer t)

(use-package flycheck-package
  :ensure t
  :hook
  (emacs-lisp-mode . flycheck-package-setup))

(use-package elsa
  :defer t
  :ensure t)

(use-package flycheck-elsa
  :ensure t
  :hook
  (emacs-lisp-mode . flycheck-elsa-setup))
#+end_src


** isearch-mb

[[https://github.com/astoff/isearch-mb][astoff/isearch-mb]]

[[https://emacs-china.org/t/isearch-mb-minibuffer-isearch-query/17878][isearch-mb: 在 minibuffer 中编辑 isearch query - Emacs China]]

** 文件管理

*** dired-hacks

https://github.com/Fuco1/dired-hacks

*** dired-recent

*** dired-narrow

*** dired-isearch

