init.org
** pyim                                                              :输入法:

#+begin_src emacs-lisp :tangle yes
;; pyim
;; {{{
(require 'pyim)
(require 'pyim-cregexp-utils)
(require 'pyim-cstring-utils)
;; (require 'pyim-basedict) ; 拼音词库设置
;; (pyim-basedict-enable)   ; 拼音词库
;; (require 'pyim-greatdict)
;; (pyim-greatdict-enable)
(require 'pyim-tsinghua-dict)
(pyim-tsinghua-dict-enable)
;; isearch 开启代码搜索中文功能（比如拼音，五笔码等）
;; (pyim-isearch-mode 1) ; 性能差，不启用
(setq default-input-method "pyim")
(setq pyim-page-style 'vertical)
(setq pyim-page-tooltip '(posframe minibuffer popup))
(setq pyim-page-length 5)
(setq-default pyim-punctuation-translate-p '(auto)) ;; 全角半角
(keymap-global-set "H-e" 'toggle-input-method)
;; (keymap-global-set [remap backward-word] #'pyim-backward-word)
;; (keymap-global-set [remap forward-word] #'pyim-forward-word)
(keymap-global-set "H-b" 'pyim-backward-word)
(keymap-global-set "H-f" 'pyim-forward-word)
(keymap-set pyim-mode-map "-" 'pyim-page-previous-page)
(keymap-set pyim-mode-map "+" 'pyim-page-next-page)
(keymap-set pyim-mode-map "H-h" 'pyim-page-previous-page)
(keymap-set pyim-mode-map "H-l" 'pyim-page-next-page)
;; 金手指设置，可以将光标处的编码，比如：拼音字符串，转换为中文。
(keymap-global-set "H-c H-s" #'pyim-convert-string-at-point)
;; 将光标前的 regexp 转换为可以搜索中文的 regexp.
;; (keymap-set minibuffer-local-map "H-c" #'pyim-cregexp-convert-at-point)
(pyim-default-scheme 'quanpin)
;;
(setq pyim-indicator-list (list #'my-pyim-indicator-with-cursor-color #'pyim-indicator-with-modeline))

(defun my-pyim-indicator-with-cursor-color (input-method chinese-input-p)
  (if (not (equal input-method "pyim"))
      (progn
        ;; 用户在这里定义 pyim 未激活时的光标颜色设置语句
        (set-cursor-color "grey")
        )
    (if chinese-input-p
        (progn
          ;; 用户在这里定义 pyim 输入中文时的光标颜色设置语句
          (set-cursor-color "purple")
          )
      ;; 用户在这里定义 pyim 输入英文时的光标颜色设置语句
      (set-cursor-color "green")
      )
    )
  )
;; 探针
(setq-default pyim-english-input-switch-functions
              '(
		pyim-probe-auto-english
                pyim-probe-program-mode
                pyim-probe-dynamic-english
                pyim-probe-isearch-mode
                pyim-probe-org-structure-template
                pyim-probe-org-speed-commands
                ))

(setq-default pyim-punctuation-half-width-functions
              '(
                pyim-probe-punctuation-line-beginning
                pyim-probe-punctuation-after-punctuation
                ))
;; 让 avy 支持拼音搜索
(with-eval-after-load 'avy
  (defun my-avy--regex-candidates (fun regex &optional beg end pred group)
    (let ((regex (pyim-cregexp-build regex)))
      (funcall fun regex beg end pred group)))
  (advice-add 'avy--regex-candidates :around #'my-avy--regex-candidates))
;; 让 vertico, selectrum 等补全框架，通过 orderless 支持拼音搜索候选项功能。
(defun my-orderless-regexp (orig-func component)
  (let ((result (funcall orig-func component)))
    (pyim-cregexp-build result)))
(advice-add 'orderless-regexp :around #'my-orderless-regexp)
;; }}}
#+end_src

*** 输入法切换探针

#+begin_src emacs-lisp :tangle no
(defun pyim-probe-dynamic-english ()
  "激活这个 pyim 探针函数后，使用下面的规则动态切换中英文输入：
1. 从光标往前找第一个非数字的字符，为中文字符时，输入下一个字符时默认开启中文输入
2. 从光标往前找第一个非数字的字符，为其他字符时，输入下一个字符时默认开启英文输入
3. 使用 `pyim-convert-string-at-point' 可以将光标前的字符串转换为中文，
   所以用户需要给 `pyim-convert-string-at-point' 绑定一个快捷键，比如：
   (global-set-key (kbd \"M-i\") #\\='pyim-convert-string-at-point)
这个函数用于：`pyim-english-input-switch-functions' 。"
  (let* ((offset 0)
         (non-digit-str-before-1 (pyim-char-before-to-string offset)))
    (while (and non-digit-str-before-1
                (cl-search non-digit-str-before-1 "0123456789"))
      (cl-incf offset)
      (setq non-digit-str-before-1 (pyim-char-before-to-string offset)))
    (if (<= (point) (save-excursion (back-to-indentation)
                                    (point)))
        (not (or (pyim-string-match-p
                  "\\cc"
                  (save-excursion
                    ;; 查找前一个非空格字符。
                    (if (re-search-backward "[^[:space:]\n]" nil t)
                        (char-to-string (char-after (point))))))
                 (> (length (pyim-process-get-entered 'point-before)) 0)))
      (not (or (pyim-string-match-p "\\cc" non-digit-str-before-1)
               (> (length (pyim-process-get-entered 'point-before)) 0))))
    )
  )

(defun pyim-probe-auto-english ()
  "激活这个 pyim 探针函数后，使用下面的规则自动切换中英文输入：
1. 当前字符为英文字符（不包括空格）时，输入下一个字符为英文字符
2. 当前字符为中文字符或输入字符为行首字符时，输入的字符为中文字符
3. 以单个空格为界，自动切换中文和英文字符
   即，形如 `我使用 emacs 编辑此函数' 的句子全程自动切换中英输入法
这个函数用于：`pyim-english-input-switch-functions' 。"
  (let ((str-before-1 (pyim-char-before-to-string 0))
        (str-before-2 (pyim-char-before-to-string 1)))
    (if (> (point) (save-excursion (back-to-indentation)
                                   (point)))
        (or (if (pyim-string-match-p " " str-before-1)
                (pyim-string-match-p "\\cc" str-before-2)
              (and (not (pyim-string-match-p "\\cc" str-before-1))
                   (= (length (pyim-process-get-entered 'point-before)) 0)))))))
#+end_src

** emacs-rime


#+begin_src emacs-lisp
(defun change-cursor-color-on-input-method ()
    "Set cursor color depending on whether an input method is used or not."
    (interactive)
    (set-cursor-color (if (and (rime--should-enable-p)
                               (not (rime--should-inline-ascii-p))
                               current-input-method)
                          input-method-cursor-color
                        default-cursor-color)))
#+end_src

[[https://github.com/DogLooksGood/emacs-rime][DogLooksGood/emacs-rime: RIME ㄓ in Emacs]]

[[https://github.com/Eason0210/im-cursor-chg][Eason0210/im-cursor-chg]]

** 系统输入法切换                                                    :输入法:

| 当前输入法 | 光标前两个单词中是否有中文 | 空格或制表符数量 | 是否切换 |
|------------+----------------------------+------------------+----------|
| 中文       | 是                         |                0 | 否       |
| 中文       | 是                         |                1 | 否       |
| 中文       | 是                         |                2 | 是       |
| 中文       | 否                         |                0 |          |
| 中文       | 否                         |                1 |          |
| 中文       | 否                         |                2 |          |
| 英文       | 是                         |                0 | 否       |
| 英文       | 是                         |                1 |          |
| 英文       | 是                         |                2 |          |
| 英文       | 否                         |                0 |          |
| 英文       | 否                         |                1 |          |
| 英文       | 否                         |                2 |          |

*** sis

#+begin_src emacs-lisp :tangle no
;; smart-input-source
;; {{{
(use-package sis
  :init
  ;; `C-s/r' 默认优先使用英文 必须在 sis-global-respect-mode 前配置
  (setq sis-respect-go-english-triggers
        (list 'isearch-forward 'isearch-backward) ; isearch-forward 时默认进入 en
        sis-respect-restore-triggers
        (list 'isearch-exit 'isearch-abort))
  :config
  (sis-ism-lazyman-config
   "com.apple.keylayout.ABC"
   "com.apple.inputmethod.SCIM.ITABC"
   'macism
   )
  (sis-global-cursor-color-mode t)
  (sis-global-respect-mode t)
  (sis-global-context-mode t)
  (sis-global-inline-mode t)   ; 中文状态下，中文后<spc>切换英文，结束后切回中文
  ;; (keymap-global-set "<f9>" #'sis-log-mode) ; 开启日志
  ;; 特殊定制
  (setq sis-default-cursor-color "blue" ;; 英文光标色
        sis-other-cursor-color "orange"  ;; 中文光标色 green
        ;; sis-inline-tighten-head-rule 'all ; 删除头部空格，默认 1，删除一个空格，1/0/'all
        sis-inline-tighten-tail-rule 'all ; 删除尾部空格，默认 1，删除一个空格，1/0/'all
        sis-inline-with-english t ; 默认是 t, 中文 context 下输入<spc>进入内联英文
        sis-inline-with-other t) ; 默认是 nil，而且 prog-mode 不建议开启, 英文 context 下输入<spc><spc>进行内联中文
  ;; 特殊 buffer 禁用 sis 前缀,使用 Emacs 原生快捷键  setqsis-prefix-override-buffer-disable-predicates
  (setq sis-prefix-override-buffer-disable-predicates
        (list 'minibufferp
              (lambda (buffer) ; magit revision magit 的 keymap 是基于 text property 的，优先级比 sis 更高。进入 magit 后，disable sis 的映射
                (sis--string-match-p "^magit-revision:" (buffer-name buffer)))
              (lambda (buffer) ; special buffer，所有*打头的 buffer，但是不包括*Scratch* *New, *About GNU 等 buffer
                (and (sis--string-match-p "^\*" (buffer-name buffer))
                     (not (sis--string-match-p "^\*About GNU Emacs" (buffer-name buffer))) ; *About GNU Emacs" 仍可使用 C-h/C-x/C-c 前缀
                     (not (sis--string-match-p "^\*New" (buffer-name buffer)))
                     (not (sis--string-match-p "^\*Scratch" (buffer-name buffer))))))) ; *Scratch*  仍可使用 C-h/C-x/C-c 前缀
  )
;; }}}
#+end_src

** 中英文空格                                                        :format:

#+begin_src emacs-lisp :tangle yes
;; pangu-spacing
;; {{{
(use-package pangu-spacing
  :defer 1
  :config
  (global-pangu-spacing-mode 1)
  (setq pangu-spacing-real-insert-separtor t)
  )
;; }}}
#+end_src

** 拼写检查 spell

