init.el
(require 'pyim-cregexp-utils)
(require 'pyim-cstring-utils)
;; (require 'pyim-basedict) ; 拼音词库设置
;; (pyim-basedict-enable)   ; 拼音词库
;; (require 'pyim-greatdict)
;; (pyim-greatdict-enable)
(require 'pyim-tsinghua-dict)
(pyim-tsinghua-dict-enable)
(setq default-input-method "pyim")
(setq pyim-page-style 'vertical)
(setq pyim-page-tooltip '(posframe minibuffer popup))
(setq pyim-page-length 9)
(setq-default pyim-punctuation-translate-p '(auto)) ;; 全角半角
(keymap-set pyim-mode-map "-" 'pyim-page-previous-page)
(keymap-set pyim-mode-map "+" 'pyim-page-next-page)
(keymap-global-set "H-e" 'toggle-input-method)
(keymap-global-set "H-b" 'pyim-backward-word)
;; (keymap-global-set [remap forward-word] #'pyim-forward-word)
;; (keymap-global-set [remap backward-word] #'pyim-backward-word)
(keymap-global-set "H-f" 'pyim-forward-word)
;; 金手指设置，可以将光标处的编码，比如：拼音字符串，转换为中文。
(keymap-global-set "H-j" #'pyim-convert-string-at-point)
;; 将光标前的 regexp 转换为可以搜索中文的 regexp.
(keymap-set minibuffer-local-map "H-c" #'pyim-cregexp-convert-at-point)
(pyim-default-scheme 'quanpin)
;; (pyim-isearch-mode 1) ;; 开启代码搜索中文功能（比如拼音，五笔码等）
;; ;
                                        ; cursor
(setq pyim-indicator-list (list #'my-pyim-indicator-with-cursor-color #'pyim-indicator-with-modeline))

(defun my-pyim-indicator-with-cursor-color (input-method chinese-input-p)
  (if (not (equal input-method "pyim"))
      (progn
        ;; 用户在这里定义 pyim 未激活时的光标颜色设置语句
        (set-cursor-color "green"))
    (if chinese-input-p
        (progn
          ;; 用户在这里定义 pyim 输入中文时的光标颜色设置语句
          (set-cursor-color "purple"))
      ;; 用户在这里定义 pyim 输入英文时的光标颜色设置语句
      (set-cursor-color "blue"))))
;; 探针
(setq-default pyim-english-input-switch-functions
              '(pyim-probe-dynamic-english
                ;; pyim-probe-isearch-mode
                pyim-probe-program-mode
                pyim-probe-org-structure-template))

(setq-default pyim-punctuation-half-width-functions
              '(pyim-probe-punctuation-line-beginning
                pyim-probe-punctuation-after-punctuation))
;; 让 avy 支持拼音搜索
(with-eval-after-load 'avy
  (defun my-avy--regex-candidates (fun regex &optional beg end pred group)
    (let ((regex (pyim-cregexp-build regex)))
      (funcall fun regex beg end pred group)))
  (advice-add 'avy--regex-candidates :around #'my-avy--regex-candidates))
;; 让 vertico, selectrum 等补全框架，通过 orderless 支持拼音搜索候选项功能。
(defun my-orderless-regexp (orig-func component)
  (let ((result (funcall orig-func component)))
    (pyim-cregexp-build result)))
(advice-add 'orderless-regexp :around #'my-orderless-regexp)
;; }}}

;; ;; smart-input-source
;; ;; {{{
;; (use-package sis
;;   :init
;;   ;; `C-s/r' 默认优先使用英文 必须在 sis-global-respect-mode 前配置
;;   (setq sis-respect-go-english-triggers
;;         (list 'isearch-forward 'isearch-backward) ; isearch-forward 时默认进入 en
;;         sis-respect-restore-triggers
;;         (list 'isearch-exit 'isearch-abort))
;;   :config
;;   (sis-ism-lazyman-config
;;    "com.apple.keylayout.ABC"
;;    "com.apple.inputmethod.SCIM.ITABC"
;;    'macism
;;    )
;;   (sis-global-cursor-color-mode t)
;;   (sis-global-respect-mode t)
;;   (sis-global-context-mode t)
;;   (sis-global-inline-mode t)   ; 中文状态下，中文后<spc>切换英文，结束后切回中文
;;   ;; (keymap-global-set "<f9>" #'sis-log-mode) ; 开启日志
;;   ;; 特殊定制
;;   (setq sis-default-cursor-color "green" ;; 英文光标色
;;         sis-other-cursor-color "purple"  ;; 中文光标色 green
;;         ;; sis-inline-tighten-head-rule 'all ; 删除头部空格，默认 1，删除一个空格，1/0/'all
;;         sis-inline-tighten-tail-rule 'all ; 删除尾部空格，默认 1，删除一个空格，1/0/'all
;;         sis-inline-with-english t ; 默认是 t, 中文 context 下输入<spc>进入内联英文
;;         sis-inline-with-other t) ; 默认是 nil，而且 prog-mode 不建议开启, 英文 context 下输入<spc><spc>进行内联中文
;;   ;; 特殊 buffer 禁用 sis 前缀,使用 Emacs 原生快捷键  setqsis-prefix-override-buffer-disable-predicates
;;   (setq sis-prefix-override-buffer-disable-predicates
;;         (list 'minibufferp
;;               (lambda (buffer) ; magit revision magit 的 keymap 是基于 text property 的，优先级比 sis 更高。进入 magit 后，disable sis 的映射
;;                 (sis--string-match-p "^magit-revision:" (buffer-name buffer)))
;;               (lambda (buffer) ; special buffer，所有*打头的 buffer，但是不包括*Scratch* *New, *About GNU 等 buffer
;;                 (and (sis--string-match-p "^\*" (buffer-name buffer))
;;                      (not (sis--string-match-p "^\*About GNU Emacs" (buffer-name buffer))) ; *About GNU Emacs" 仍可使用 C-h/C-x/C-c 前缀
;;                      (not (sis--string-match-p "^\*New" (buffer-name buffer)))
;;                      (not (sis--string-match-p "^\*Scratch" (buffer-name buffer))))))) ; *Scratch*  仍可使用 C-h/C-x/C-c 前缀
;;   )
;; ;; }}}

;; pangu-spacing
;; {{{
(use-package pangu-spacing
  :defer 1
  :config
  (global-pangu-spacing-mode 1)
  (setq pangu-spacing-real-insert-separtor t)
  )
;; }}}
