init.org
** Bookmark 书签

binky-mode

#+begin_src emacs-lisp :tangle yes
;; binky-mode
;; {{{

;; }}}
#+end_src

** 剪贴板 kill-ring/clipboard

#+begin_src emacs-lisp :tangle no
(use-package browse-kill-ring
  :load-path  (lambda ()
                (expand-file-name
                 (concat
                  my-user-emacs-directory
                  "contrib/")
                 )
                )
                                        ;:load-path (concat my-user-emacs-directory "contrib/")
  :config
  (browse-kill-ring-default-keybindings); map M-y to browse-kill-ring
  )
#+end_src

** snippet

*** YASnippet

#+begin_src emacs-lisp :tangle yes
;; yasnippet
;; {{{
(use-package yasnippet
  :config
  (yas-global-mode 1)
  )
;; }}}
#+end_src

*** yankpad

#+begin_src emacs-lisp :tangle no
(use-package yankpad
  :ensure t
  ;; :defer 10
  :init
  (setq yankpad-file (concat user-emacs-directory "yankpad.org"))
  :bind (:map my-map ("SPC" . yankpad-insert)
              ("y" . yankpad-expand)
              )
  :config
  (bind-key "<f7>" 'yankpad-map)
  (bind-key "<f12>" 'yankpad-expand)
  ;; If you want to complete snippets using company-mode
  (add-to-list 'company-backends #'company-yankpad)
  ;; If you want to expand snippets with hippie-expand
  (add-to-list 'hippie-expand-try-functions-list #'yankpad-expand))
#+end_src

*** Tempel

** 帮助※文档

#+begin_src emacs-lisp :tangle yes
;; helpful
;; {{{
(use-package helpful
  :bind
  ("C-h f" . helpful-function)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-command] . helpful-command)
  ([remap describe-key] . helpful-key))
;; Note that the built-in `describe-function' includes both functions
;; and macros. `helpful-function' is functions only, so we provide
;; `helpful-callable' as a drop-in replacement.
;; (keymap-global-set "C-h f" #'helpful-callable)
;; (keymap-global-set "C-h v" #'helpful-variable)
;; (keymap-global-set "C-h k" #'helpful-key)
;;
;; Lookup the current symbol at point. C-c C-d is a common keybinding
;; for this in lisp modes.
;; (keymap-global-set "C-c C-d" #'helpful-at-point)
;;
;; Look up *F*unctions (excludes macros).
;; (keymap-global-set "C-h F" #'helpful-function)
;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
;; already links to the manual, if a function is referenced there.
;;
;; Look up *C*ommands.
;; (keymap-global-set "C-h C" #'helpful-command)
;; By default, C-h C is bound to describe `describe-coding-system'. I
;; don't find this very useful, but it's frequently useful to only
;; look at interactive functions.
;;
;; helpful + ivy
;; (setq counsel-describe-function-function #'helpful-callable)
;; (setq counsel-describe-variable-function #'helpful-variable)
;; }}}
#+end_src

** UI 提示

*** header

#+begin_src emacs-lisp :tangle yes
;; sticky header: topsy
;; {{{
;; (add-hook 'prog-mode-hook #'topsy-mode)
(use-package topsy
  :hook (prog-mode . topsy-mode)
  )
;; (add-hook 'org-mode-hook #'org-sticky-header-mode)
(use-package org-sticky-header
  :hook (org-mode . org-sticky-header-mode)
  :config
  (setq org-sticky-header-full-path 'full)
  )
;; }}}
#+end_src

*** 版本控制

#+begin_src emacs-lisp :tangle yes
;; diff-hl
;; {{{
(use-package diff-hl
  :defer 2
  :config
  (global-diff-hl-mode)
  )
;; (global-git-gutter-mode +1) ; BUG when deleting folded 17000+lines

;; }}}
#+end_src

*** region: goggles

#+begin_src emacs-lisp :tangle yes
;; goggles: visual hint for operations
;; {{{
(use-package goggles
  :hook ((prog-mode text-mode) . goggles-mode)
  :config
  (setq-default goggles-pulse t)) ;; set to nil to disable pulsing
;; }}}
#+end_src

*** 括号: highlight-parentheses

#+begin_src emacs-lisp :tangle yes
;; highlight-parentheses
;; {{{
(require 'highlight-parentheses)
;; (add-hook 'prog-mode-hook #'highlight-parentheses-mode)
(global-highlight-parentheses-mode 1)
;; 括号颜色（由内向外）
(setq highlight-parentheses-colors '(
                                     "Green"
                                     "Blue"
                                     "Orange"
                                     "Purple"
                                     "Yellow"
                                     "Red"
                                     ;; "Pink" ;; only six colors supported ?
                                     ))
;; Apple Six Colors
;; (setq highlight-parentheses-colors '("#61BB46" "#FDB827" "#F5821F" "#E03A3E" "#963D97" "#009DDC"))
;;
;; Emacs builtin
;; (setq show-paren-when-point-inside-paren t
;;       show-paren-when-point-in-periphery t)
;; }}}
#+end_src

*** modeline

#+begin_src emacs-lisp :tangle yes
;; doom-modeline
;; {{{
;; (add-hook 'after-init-hook #'doom-modeline-mode)
;; (setq doom-modeline-support-imenu t)
(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom
  ;; Don't compact font caches during GC. Windows Laggy Issue
  (inhibit-compacting-font-caches t)
  (doom-modeline-minor-modes nil)
  (doom-modeline-icon t)
  (doom-modeline-major-mode-color-icon t)
  :config
  (doom-modeline-mode)
  (setq doom-modeline-height 18)
  (setq doom-modeline-window-width-limit 85)
  (setq doom-modeline-icon (display-graphic-p))
  (setq find-file-visit-truename t)
  (setq doom-modeline-highlight-modified-buffer-name t)
  (setq doom-modeline-project-detection 'auto) ;auto/project
  (setq doom-modeline-buffer-file-name-style 'relative-to-project)
  )
;; }}}
#+end_src

*** ICON 图标

#+begin_src emacs-lisp :tangle yes
;; all-the-icons
;; {{{
;; (use-package all-the-icons :if (display-graphic-p))
(when (display-graphic-p)
  (require 'all-the-icons)
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
  (add-hook 'marginalia-mode-hook #'all-the-icons-completion-marginalia-setup))
;; }}}
#+end_src

** 折叠

*** origami

#+begin_src emacs-lisp :tangle yes
;; fold: origami
;; {{{
(add-hook 'prog-mode-hook 'origami-mode)
(with-eval-after-load 'origami
  (define-key origami-mode-map (kbd "C-c f") 'origami-recursively-toggle-node)
  (define-key origami-mode-map (kbd "C-c F") 'origami-toggle-all-nodes)
  )
;; }}}
#+end_src

*** hideshow-orgmode

https://github.com/logangrado/hideshow-orgmode

** 选择

*** expand-region

#+begin_src emacs-lisp :tangle yes
;; expand-region
;; {{{
(keymap-global-unset "C-=")
(keymap-global-unset "C--")
(use-package expand-region
  :bind (("C-=" . er/expand-region)
         ("C--" . er/contract-region))
  )
;; }}}
#+end_src

*** symbol-overlay

#+begin_src emacs-lisp :tangle yes
;; symbol-overlay
;; {{{
(use-package symbol-overlay
  :bind(("M-i"  . symbol-overlay-put)
        ("M-n"  . symbol-overlay-switch-forward)
        ("M-p"  . symbol-overlay-switch-backward)
        ("<f7>" . symbol-overlay-mode)
        ("<f8>" . symbol-overlay-remove-all)
        :map symbol-overlay-map
        ("d" . symbol-overlay-jump-to-definition)
        ("e" . symbol-overlay-echo-mark)
        ("i" . symbol-overlay-put)
        ("n" . symbol-overlay-jump-next)
        ("p" . symbol-overlay-put)
        ("q" . symbol-overlay-query-replace)
        ("r" . symbol-overlay-rename)
        ("s" . symbol-overlay-isearch-literally)
        ("t" . symbol-overlay-toggle-in-scope)
        ("w" . symbol-overlay-save-symbol)
        )
  )
;; (require 'symbol-overlay)
;; (keymap-global-set "M-i"  #'symbol-overlay-put)
;; (keymap-global-set "M-n"  #'symbol-overlay-switch-forward)
;; (keymap-global-set "M-p"  #'symbol-overlay-switch-backward)
;; (keymap-global-set "<f7>" #'symbol-overlay-mode)
;; (keymap-global-set "<f8>" #'symbol-overlay-remove-all)
;; (keymap-set symbol-overlay-mode "d" symbol-overlay-jump-to-definition)
;; (keymap-set symbol-overlay-mode "e" symbol-overlay-echo-mark)
;; (keymap-set symbol-overlay-mode "i" symbol-overlay-put)
;; (keymap-set symbol-overlay-mode "n" symbol-overlay-jump-next)
;; (keymap-set symbol-overlay-mode "p" symbol-overlay-jump-prev)
;; (keymap-set symbol-overlay-mode "q" symbol-overlay-query-replace)
;; (keymap-set symbol-overlay-mode "r" symbol-overlay-rename)
;; (keymap-set symbol-overlay-mode "s" symbol-overlay-isearch-literally)
;; (keymap-set symbol-overlay-mode "t" symbol-overlay-toggle-in-scope)
;; (keymap-set symbol-overlay-mode "w" symbol-overlay-save-symbol)
;; }}}
#+end_src

