init.org
*** org-similarity

#+begin_src emacs-lisp :tangle yes
;; org-similarity
;; {{{
(use-package org-similarity
  :ensure nil
  :after (org-roam)
  :config
  (with-suppressed-warnings
      (defvaralias
        'org-similarity-directory
        'org-roam-directory)
    )
  (setq org-similarity-language "english")
  (setq org-similarity-number-of-documents 15)
  (setq org-similarity-show-scores t)
  (setq org-similarity-use-id-links t)
  (setq org-similarity-recursive-search t)
  )
;; }}}
#+end_src

*** md-roam

#+begin_src emacs-lisp :tangle yes
;; md-roam
;; {{{
;; https://emacs.stackexchange.com/questions/5465/how-to-migrate-markdown-files-to-emacs-org-mode-format
;; (require 'org-roam)
;; M-x package-vc-install RET https://github.com/nobiot/md-roam.git RET
;; (require 'md-roam)
;; (md-roam-mode 1)           ; md-roam-mode must be active before org-roam-db-sync
;; (setq md-roam-file-extension "md") ; default "md". Specify an extension such as "markdown"
;; (org-roam-db-autosync-mode 1) ; autosync-mode triggers db-sync. md-roam-mode must be already active
;; }}}
#+end_src


** org-ref

** org-mind-map

[[https://github.com/the-ted/org-mind-map][the-ted/org-mind-map]]: This is an emacs package that creates graphviz directed graphs.

** markdown

#+begin_src emacs-lisp :tangle yes
;; markdown-mode
;; {{{
(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . gfm-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "pandoc")
  :config
  (setq visual-line-column 90)
  (setq markdown-fontify-code-blocks-natively t)
  (setq markdown-enable-wiki-links t) ;; wikilink/backlink
  (setq markdown-wiki-link-search-type "project")
  (setq markdown-enable-math t)
  )
;; }}}
#+end_src

** RFC

#+begin_src emacs-lisp :tangle yes
;; RFC
;; {{{
(use-package rfc-mode
  :defer t
  :config
  (setq rfc-mode-directory (expand-file-name "~/Documents/GitHub/RFC-all/txt/"))
  )
;; }}}
#+end_src

** 跟随系统 UI

#+begin_src emacs-lisp :tangle yes
;; auto-dark
;; {{{
(use-package auto-dark
  :init (auto-dark-mode t)
  :config
  (setq auto-dark-allow-osascript t
        auto-dark-dark-theme 'solarized-dark)
  )
;; }}}
#+end_src

** frame 管理

*** moom

#+begin_src emacs-lisp :tangle yes
(with-eval-after-load "moom"
  (setq moom-use-font-module nil)
  ;; (moom-recommended-keybindings '(all wof))
  (moom-recommended-keybindings '(move fit expand fill font reset undo))
  (when (require 'moom-transient nil t)
    (moom-transient-hide-cursor) ;; if needed
    (define-key moom-mode-map (kbd "C-c o") #'moom-transient-dispatch)
    )
  )
#+end_src

#+begin_src emacs-lisp :tangle no
;; moom + transient
;; {{{
(with-suppressed-warnings '(void-function transient-prefix)) ;FIXME
(add-to-list 'warning-suppress-types '((void-function transient-prefix)))
(use-package moom
  ;; :after transcient
  :defer 1
  :ensure nil
  ;; :if (memq window-system '(mac ns x))
  ;; (keymap-global-set "" #'moom-font-increase)
  :commands (moom-transient-dispatch moom-transient-config)
  :config
  (require 'moom-transient)
  (setq moom-use-font-module nil)
  (moom-mode 1)
  (moom-transient-hide-cursor) ;; if needed
  ;; (define-key moom-mode-map (kbd "C-c o") #'moom-transient-dispatch)
  (moom-recommended-keybindings '(move fit expand fill font reset undo))
  )

;; (unless (and (display-graphic-p) (eq system-type 'darwin))
;;   (add-hook 'after-init-hook 'moom-mode)
;;   )
;; }}}
#+end_src

** window 管理

#+begin_src emacs-lisp :tangle yes
;; {{{ ace-window
;; (require 'ace-window)
;; (keymap-global-set "H-o" #'ace-window)
(use-package ace-window
  :bind
  ("H-o" . ace-window)
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  )
;; }}}
#+end_src

** 光标跳转

#+begin_src emacs-lisp :tangle yes
;; goto-line-preview
;; {{{
(use-package goto-line-preview
  :bind
  ;; ([remap goto-line] . goto-line-preview)
  ("C-c H-l" . goto-line-preview)
  )
;; }}}
#+end_src

** UI

#+begin_src emacs-lisp :tangle no
;; ;; olivetti
;; ;; {{{
;; ;; https://emacs-china.org/t/emacs/19797/4
;; (use-package olivetti
;;   :diminish
;;   :bind ("<f8>" . olivetti-mode)
;;   :init
;;   (setq olivetti-body-width 90)         ; default: fill-column+2
;;   (defun xs-toggle-olivetti-for-org ()
;;     "if current buffer is org and only one visible buffer
;;   enable olivetti mode"
;;     (if (and (eq (buffer-local-value 'major-mode (current-buffer)) 'org-mode)
;;              (or (eq (length (window-list nil nil nil)) 1)
;;                  (window-at-side-p (frame-first-window) 'right))) ;; frame-first-window 的 mode 是 org-mode 并且没有右边 window
;;         (olivetti-mode 1)
;;       (olivetti-mode 0)
;;       (when (eq (buffer-local-value 'major-mode (current-buffer)) 'org-mode)
;;         (visual-line-mode 1))))
;;   (add-hook 'org-mode-hook #'xs-toggle-olivetti-for-org)
;;   (add-hook 'window-configuration-change-hook #'xs-toggle-olivetti-for-org))
;; ;; }}}
#+end_src

** 图表

*** Graphviz

#+begin_src emacs-lisp :tangle yes
;; graphviz-dot-mode
;; {{{
(setq graphviz-dot-indent-width 4)
(setq graphviz-dot-preview-extension "svg")
;; }}}
#+end_src

*** PlantUML

*** D2

** 地图

#+begin_src emacs-lisp :tangle yes
;; osm: OpenStreetMap
;; {{{
(use-package osm
  :defer t
  :after org
  :bind (("C-c m h" . osm-home)
         ("C-c m s" . osm-search)
         ("C-c m v" . osm-server)
         ("C-c m t" . osm-goto)
         ("C-c m x" . osm-gpx-show)
         ("C-c m j" . osm-bookmark-jump))

  :custom
  ;; Take a look at the customization group `osm' for more options.
  (osm-server 'default) ;; Configure the tile server
  (osm-copyright t)     ;; Display the copyright information

  :init
  ;; Load Org link support
  (with-eval-after-load 'org
    (require 'osm-ol)))
;; }}}
#+end_src

** 网页浏览、信息订阅、阅读

*** mybigword

#+begin_src emacs-lisp :tangle yes
;; mybigword
;; {{{
(use-package mybigword
  :defer t
  :config
  (setq mybigword-excluded-words
        (split-string (with-temp-buffer
                        (insert-file-contents  (expand-file-name
                                                "assets/mybigword.txt"
                                                (concat user-emacs-directory)
                                                ))
                        (buffer-string)) "[\r\n]+"))
  )
;; mybigword-excluded-words
;; mybigword-personal-excluded-words
;; mybigword-upper-limit
;; }}}
#+end_src

*** elfeed

#+begin_src emacs-lisp :tangle yes
;; elfeed
;; {{{
;; reference: https://github.com/jiacai2050/jiacai2050.github.io/blob/hugo/playground/mu4e-elfeed-config.el
(use-package elfeed
  :defer t
  :ensure nil
  :custom((elfeed-use-curl t)
          (elfeed-db-directory "~/Downloads/elfeed/")
          (elfeed-curl-timeout 20)
          )
  )

;; elfeed-dashboard
(use-package elfeed-dashboard
  :ensure nil
  )

;;elfeed-org
(use-package elfeed-org
  :ensure nil
  :hook (elfeed-dashboard-mode . elfeed-org)
  )
;; }}}
#+end_src

*** nov + shrface + eww

#+begin_src emacs-lisp :tangle yes
;; shrface eww nov
;; {{{
(use-package shrface
  :defer t
  :config
  (shrface-basic)
  (shrface-trial)
  (shrface-default-keybindings) ; setup default keybindings
  (setq shrface-href-versatile t))
(use-package eww
  :defer t
  :init
  (add-hook 'eww-after-render-hook #'shrface-mode)
  :config
  (require 'shrface))
(use-package nov
  :defer t
  :mode ("\\.[eE][pP][uU][bB]\\'" . nov-mode)
  :init
  (add-hook 'nov-mode-hook #'shrface-mode)
  :config
  ((setq nov-text-width 80)
   (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
   (add-to-list 'auto-mode-alist '("\\.epub$" . nov-mode))
   (require 'shrface)
   (setq nov-shr-rendering-functions '((img . nov-render-img) (title . nov-render-title)))
   (setq nov-shr-rendering-functions (append nov-shr-rendering-functions shr-external-rendering-functions))
   )
  )
;; }}}
#+end_src

*** PDF

#+begin_src emacs-lisp :tangle no
;; ;; pdf-tools
;; ;; {{{
;; ;; https://github.com/furkanusta/dotfiles/blob/master/emacs/dot-emacs.d/elisp/usta-uncategorized.el
;; (use-package pdf-tools
;;   :ensure nil
;;   ;; :magic ("%PDF" . pdf-view-mode)
;;   :mode ("\\.[pP][dD][fF]\\'" . pdf-view-mode)
;;   ;; :hook (
;;     ;; (pdf-view-mode . disable-line-numbers)
;;          ;; (pdf-view-mode . pdf-sync-minor-mode)
;;          ;; (pdf-view-mode . pdf-links-minor-mode)
;;          ;; (pdf-view-mode . pdf-history-minor-mode)
;;          ;; (pdf-view-mode . pdf-annot-minor-mode)
;;          ;; (pdf-view-mode . pdf-view-themed-minor-mode)
;;     ;; )
;;   :custom
;;   (pdf-view-display-size 'fit-page)
;;   ;; (pdf-annot-activate-created-annotations nil)
;;   (pdf-view-resize-factor 1.1)
;;   :bind (:map pdf-view-mode-map
;;          ("M-w" . pdf-view-kill-ring-save)
;;               ("o" . pdf-outline)
;;               ("O" . pdf-occur)
;;               ("M-g M-g" . pdf-view-goto-page)
;;               ("S-SPC" . pdf-view-scroll-down-or-previous-page)
;;          ("<double-wheel-down>" .  pdf-view-next-line-or-next-page)
;;          ("<triple-wheel-down>" .  pdf-view-next-line-or-next-page)
;;          ("j" . pdf-view-next-line-or-next-page)
;;          ("k" . pdf-view-previous-line-or-previous-page)
;;          ("J" . forward-page)
;;          ("K" . backward-page)
;;          ("=" . pdf-view-enlarge)
;;          ("-" . pdf-view-shrink)
;;          ("w" . pdf-view-fit-width-to-window)
;;          ("h" . pdf-view-fit-height-to-window)
;;          ("p" . pdf-view-fit-page-to-window)
;;          ("/" . isearch-forward)
;;     )
;;   )

;; ;; (keymap-set pdf-view-mode "<double-wheel-down>"  #'pdf-view-next-line-or-next-page)
;; ;; (keymap-set pdf-view-mode "<triple-wheel-down>"  #'pdf-view-next-line-or-next-page)
;; ;; }}}
#+end_src


*** 速读 speed-reading

https://github.com/zk-phi/spray

#+begin_src emacs-lisp :tangle no
(use-package spray
  :ensure nil
  :defer 110
  :config ;; executed after loading package
  :bind (:map my-map ("s" . spray-mode))
  )
#+end_src

** 邮件/邮箱

*** notmuch

** crux

[[https://github.com/bbatsov/crux][bbatsov/crux: A Collection of Ridiculously Useful eXtensions for Emacs]]

