init.org
*** lsp-bridge


#+begin_src emacs-lisp :tangle no
;; (keymap-set acm-mode-map "H-;" 'lsp-bridge-toggle-sdcv-helper)
;; (define-key map [remap next-line] #'acm-select-next)
;; (define-key map [remap previous-line] #'acm-select-prev)
;; (define-key map [down] #'acm-select-next)
;; (define-key map [up] #'acm-select-prev)
;; (define-key map [tab]  #'acm-complete)
;; (define-key map "\M-n" #'acm-select-next)
;; (define-key map "\M-p" #'acm-select-prev)
;; (define-key map "\M-," #'acm-select-last)
;; (define-key map "\M-." #'acm-select-first)
;; (define-key map "\C-m" #'acm-complete)
;; (define-key map "\t" #'acm-complete)
;; (define-key map "\n" #'acm-complete)
;; (define-key map "\M-h" #'acm-complete)
;; (define-key map "\M-H" #'acm-insert-common)
;; (define-key map "\M-u" #'acm-filter)
;; (define-key map "\M-d" #'acm-doc-toggle)
;; (define-key map "\M-j" #'acm-doc-scroll-up)
;; (define-key map "\M-k" #'acm-doc-scroll-down)
;; (define-key map "\M-l" #'acm-hide)
;; (define-key map "\C-g" #'acm-hide)
#+end_src

#+begin_src emacs-lisp :tangle yes
(require 'yasnippet)
(yas-global-mode 1)
(require 'lsp-bridge)
(setq lsp-bridge-enable-mode-line -1)
;; (setq lsp-bridge-use-ds-pinyin-in-org-mode t)
;; (setq lsp-bridge-use-wenls-in-org-mode t)
(setq acm-enable-quick-access t)
(setq acm-quick-access-modifier 'meta)
(add-to-list 'lsp-bridge-org-babel-lang-list "emacs-lisp")
(add-to-list 'lsp-bridge-org-babel-lang-list "shell")

;; (keymap-set acm-mode-map "ESC"       'acm-hide)   ; FIXME

(keymap-unset acm-mode-map "SPC")
(keymap-unset acm-mode-map "RET")
(keymap-unset acm-mode-map "TAB")
(keymap-unset acm-mode-map "<tab>")
;; complete
(keymap-set acm-mode-map "SPC"       'acm-complete)
(keymap-set acm-mode-map "RET"       'acm-complete)
;; select 方案一
(keymap-set acm-mode-map "TAB"       'acm-select-next)
(keymap-set acm-mode-map "H-TAB"       'acm-select-next)
(keymap-set acm-mode-map "<backtab>" 'acm-select-prev)
;; select 方案二
(keymap-set acm-mode-map "H-j"       'acm-select-next)
(keymap-set acm-mode-map "H-k"       'acm-select-prev)
;; select 方案三
;; (keymap-set acm-mode-map "RET"     'acm-select-next)
;; (keymap-set acm-mode-map "<tab>"     'acm-select-prev)
;; abort
(keymap-set acm-mode-map "C-j"       'acm-insert-common)

(global-lsp-bridge-mode)
#+end_src



#+begin_src emacs-lisp :tangle no
;; lsp-bridge                                        ; FIXME
;; {{{
(use-package lsp-bridge
  :ensure nil
  ;; :after (yasnippet)
  ;; :bind
  :init  (setq lsp-bridge-enable-mode-line nil)
  ;; :hook ((prog-mode org-mode) . lsp-bridge-mode)
  :hook (prog-mode . lsp-bridge-mode)
  :bind (:map acm-mode-map
	      ("TAB"       . acm-select-next)
	      ("<backtab>" . acm-select-prev)
	      ("C-j"       . acm-insert-common)
	      ("SPC"       . acm-complete)
	      ("ESC"       . acm-hide)
	 )
  :config
  (setq acm-enable-quick-access t)
  (setq acm-quick-access-modifier 'meta)
  ;; (setq lsp-bridge-use-ds-pinyin-in-org-mode t)
  (add-to-list 'lsp-bridge-org-babel-lang-list "emacs-lisp")
  (add-to-list 'lsp-bridge-org-babel-lang-list "shell")
  )
;; (setq lsp-bridge-enable-mode-line nil)
;; (setq lsp-bridge-use-wenls-in-org-mode t)
;; (run-with-idle-timer
;;  1 nil
;;  #'(lambda ()
;;      (require 'yasnippet)
;;      (yas-global-mode 1)
;;      (require 'lsp-bridge)
;;      (global-lsp-bridge-mode)
;;      ))
;; }}}
#+end_src


** parrot

#+begin_src emacs-lisp

#+end_src

** Fuck

#+begin_src emacs-lisp :tangle no
;; fuck
;; {{{
(require 'fuck)
(keymap-global-set "H-k" #'fuck)
;; }}}
#+end_src

** Unicode

#+begin_src emacs-lisp :tangle yes
;; unicode
;; {{{
(require 'modeline-char)
(add-hook 'after-init-hook 'mlc-char-in-mode-line-mode-global)
;; }}}
#+end_src

** org-auto-tangle

#+begin_src emacs-lisp :tangle yes
;; org-auto-tangle
;; {{{
(use-package org-auto-tangle
  :ensure nil
  :hook (org-mode . org-auto-tangle-mode)
  )
;; }}}
#+end_src

** 折叠


#+begin_src emacs-lisp :tangle yes
;; ts-fold
;; {{{
;; (use-package ts-fold
;;   :ensure nil
;;   )
;; (add-hook 'tree-sitter-after-on-hook #'ts-fold-indicators-mode)
;; }}}
#+end_src

** 多媒体

*** 音乐播放器

#+begin_src emacs－lisp :tangle no
(require 'netease-cloud-music)
(require 'netease-cloud-music-ui) ; TUI
(require 'netease-cloud-music-comment) 
#+end_src

*** 字幕※歌词 Subtitle & Lyric

#+begin_src emacs-lisp :tangle yes
;; subed: subtitle edit
;; {{{
(use-package subed
  :defer t
  :ensure nil
  :config
  ;; Disable automatic movement of point by default
  (add-hook 'subed-mode-hook 'subed-disable-sync-point-to-player)
  ;; Remember cursor position between sessions
  (add-hook 'subed-mode-hook 'save-place-local-mode)
  ;; Break lines automatically while typing
  (add-hook 'subed-mode-hook 'turn-on-auto-fill)
  ;; Break lines at 40 characters
  (add-hook 'subed-mode-hook (lambda () (setq-local fill-column 40))))
;; }}}
#+end_src

*** STT

*** TTS

*** Video



** 图表

*** D2

#+begin_src emacs-lisp :tangle yes
;; D2 Mode
;; {{{
(add-to-list 'auto-mode-alist '("\\.d2" . d2-mode))
(defvar d2-mode-map
  (let ((map (make-sparse-keymap)))
    (keymap-set map "C-c C-c" #'d2-compile)
    (keymap-set map "C-c C-f" #'d2-compile-file)
    (keymap-set map "C-c C-b" #'d2-compile-buffer)
    (keymap-set map "C-c C-r" #'d2-compile-region)
    (keymap-set map "C-c C-h" #'d2-compile-file-and-browse)
    (keymap-set map "C-c C-j" #'d2-compile-buffer-and-browse)
    (keymap-set map "C-c C-k" #'d2-compile-region-and-browse)
    (keymap-set map "C-c C-o" #'d2-open-browser)
    (keymap-set map "C-x C-o" #'d2-view-current-svg)
    (keymap-set map "C-c C-d" #'d2-open-doc)
    map))
;; (org-babel-do-load-languages
;;     'org-babel-load-languages
;;     '(
;;       ;; (mermaid . t)
;;       (scheme . t)
;;       (d2 . t)))
;; }}}
#+end_src

** 阅读

#+begin_src emacs-lisp :tangle yes
(use-package nov-xwidget
  :ensure nil
  :demand t
  :after nov
  :config
  (define-key nov-mode-map (kbd "o") 'nov-xwidget-view)
  (add-hook 'nov-mode-hook 'nov-xwidget-inject-all-files))
#+end_src


** 图像

#+begin_src emacs-lisp :tangle yes
;; image-roll
;; {{{
(use-package image-roll
  :ensure nil
  )
;; }}}


#+end_src


* File End

#+begin_src emacs-lisp :tangle yes
;;; init.el ends here
#+end_src


* Software

** 快捷指令

** Alfred



* Misc

[[https://github.com/HerculeWu/HubbleEmacs/blob/main/Emacs.org][HerculeWu/HubbleEmacs/Emacs.org]]

[[https://github.com/novoid/dot-emacs/blob/master/config.org][novoid/dot-emacs/config.org]]

[[https://karl-voit.at/2017/06/03/emacs-org/][My Emacs Configuration In Org-mode]]

[[https://emacs-china.org/t/org-mode-python/16834][org-mode 记录学习时间，用python数据可视化 - Emacs China]]
