init.el
(use-package lsp-bridge
  :ensure nil
  :after (yasnippet)
  ;; :bind
  :hook (prog-mode . lsp-bridge-mode)
  :config
  ;; DON'T setup any of acm keymap                       ; FIXME
  ;; (keymap-set lsp-bridge-mode-map "H-;" 'lsp-bridge-toggle-sdcv-helper)
  ;; (keymap-set lsp-bridge-mode-map "TAB" 'acm-select-next)
  ;; (keymap-set lsp-bridge-mode-map "<backtab>" 'acm-select-prev)
  ;; (keymap-set lsp-bridge-mode-map "SPC" 'acm-insert-common)
  ;; (keymap-set lsp-bridge-mode-map "RET" 'acm-complete)
  ;; (keymap-set lsp-bridge-mode-map "ESC" 'acm-hide )
  ;; (setq acm-quick-access-modifier 'meta)
  ;; (setq acm-enable-quick-access t)
  (setq lsp-bridge-enable-mode-line nil)
  (setq lsp-bridge-use-wenls-in-org-mode t)
  ;; (global-lsp-bridge-mode)
  (add-to-list 'lsp-bridge-org-babel-lang-list "emacs-lisp")
  (add-to-list 'lsp-bridge-org-babel-lang-list "shell")
  )
;; (setq lsp-bridge-enable-mode-line nil)
;; (setq lsp-bridge-use-wenls-in-org-mode t)
;; (run-with-idle-timer
;;  1 nil
;;  #'(lambda ()
;;      (require 'yasnippet)
;;      (yas-global-mode 1)
;;      (require 'lsp-bridge)
;;      (global-lsp-bridge-mode)
;;      ))
;; }}}

;; fuck
;; {{{
(require 'fuck)
(keymap-global-set "H-k" #'fuck)
;; }}}

;; unicode
;; {{{
(require 'modeline-char)
(add-hook 'after-init-hook 'mlc-char-in-mode-line-mode-global)
;; }}}

;; org-auto-tangle
;; {{{
(use-package org-auto-tangle
  :ensure nil
  :hook (org-mode . org-auto-tangle-mode)
  )
;; }}}

;; ts-fold
;; {{{
;; (use-package ts-fold
;;   :ensure nil
;;   )
;; (add-hook 'tree-sitter-after-on-hook #'ts-fold-indicators-mode)
;; }}}

;; subed: subtitle edit
;; {{{
(use-package subed
  :defer t
  :ensure nil
  :config
  ;; Disable automatic movement of point by default
  (add-hook 'subed-mode-hook 'subed-disable-sync-point-to-player)
  ;; Remember cursor position between sessions
  (add-hook 'subed-mode-hook 'save-place-local-mode)
  ;; Break lines automatically while typing
  (add-hook 'subed-mode-hook 'turn-on-auto-fill)
  ;; Break lines at 40 characters
  (add-hook 'subed-mode-hook (lambda () (setq-local fill-column 40))))
;; }}}

;; D2 Mode
;; {{{
(add-to-list 'auto-mode-alist '("\\.d2" . d2-mode))
(defvar d2-mode-map
  (let ((map (make-sparse-keymap)))
    (keymap-set map "C-c C-c" #'d2-compile)
    (keymap-set map "C-c C-f" #'d2-compile-file)
    (keymap-set map "C-c C-b" #'d2-compile-buffer)
    (keymap-set map "C-c C-r" #'d2-compile-region)
    (keymap-set map "C-c C-h" #'d2-compile-file-and-browse)
    (keymap-set map "C-c C-j" #'d2-compile-buffer-and-browse)
    (keymap-set map "C-c C-k" #'d2-compile-region-and-browse)
    (keymap-set map "C-c C-o" #'d2-open-browser)
    (keymap-set map "C-x C-o" #'d2-view-current-svg)
    (keymap-set map "C-c C-d" #'d2-open-doc)
    map))
;; (org-babel-do-load-languages
;;     'org-babel-load-languages
;;     '(
;;       ;; (mermaid . t)
;;       (scheme . t)
;;       (d2 . t)))
;; }}}

(use-package nov-xwidget
  :ensure nil
  :demand t
  :after nov
  :config
  (define-key nov-mode-map (kbd "o") 'nov-xwidget-view)
  (add-hook 'nov-mode-hook 'nov-xwidget-inject-all-files))

;; image-roll
;; {{{
(use-package image-roll
  :ensure nil
  )
;; }}}

;;; init.el ends here
